/*
信号是由操作系统发送给进程的异步通知，用于通知进程发生了某种事件。信号可以用于处理各种情况，例如终止进程、暂停进程、处理异常等。
在C++中，可以使用信号处理函数来捕获和处理这些信号，从而实现对程序行为的控制和管理。

下列信号可以在程序中捕获，并基于这些信号执行特定的操作：包含在头文件<csignal>中
1. SIGINT（中断信号）：通常由用户按下Ctrl+C发送，用于请求终止程序的执行。
    可以在信号处理函数中执行清理操作或保存状态，然后安全地退出程序
2. SIGTERM（终止信号）：通常由操作系统或其他进程发送，用于请求程序终止。
    可以在信号处理函数中执行必要的清理操作，然后退出程序
3. SIGSEGV（段错误信号）：当程序访问无效的内存地址时，会触发该信号。
    ~可以在信号处理函数中记录错误信息、生成核心转储文件或执行其他调试操作，以帮助开发人员定位和修复问题~
4. SIGABRT（异常终止信号）：通常由程序调用abort()函数触发，用于指示程序异常终止。
    ~
5. SIGFPE（浮点异常信号）：当程序执行浮点运算时发生错误（如除以零）时，会触发该信号。
    ~
6. SIGILL（非法指令信号）：当程序执行非法或未定义的指令时，会触发该信号。
    ~

c++提供了signal函数用于捕获突发事件
    void (*signal(int sig, void (*func)(int)))(int);
        第一个函数指向设置好的信号标识符，第二个函数指向信号处理函数的指针，
        返回值是一个指向先前信号处理函数的指针，如果没有设置过信号处理函数，则返回SIG_DFL。
        
    可以使用raise函数来发送信号给当前进程
        int raise(int sig);
            sig：要发送的信号标识符
            返回值：如果成功发送信号，则返回0；如果失败，则返回非零值。
*/

#include <iostream>
#include <csignal>
#include <unistd.h>

void signalHandler(int signum)
{
    std::cout << "中断信号 (" << signum << ") 接收到，程序终止。" << std::endl;
    exit(signum);
}

int main()
{
    signal(SIGINT, signalHandler);
    while (1)
    {
        std::cout << "going to sleep ..." << std::endl;
        sleep(1);
    }
    return 0;
}